app/controllers/messages_controller.rb

  def create
    # передаем в метод 2 именованных параметра
    #message = Message.create(
    #  body: params[:message][:body],
    #  user_id: params[:message][:user_id]
    #)
    # чтобы злоумышленник не мог изменить данные
    # permitted? - понимает, можно ли с этими параментрами
    # отправлять запрос в БД (защита от дурака)
    # приватный метод message_params
    message = Message.create(message_params)
---
INSERT INTO "messages" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Привет "], ["user_id", 1], ["created_at", "2022-07-05 06:38:16.760561"], ["updated_at", "2022-07-05 06:38:16.760561"]]

  def update
    #@message = Message.find(params[:id])
    @message.update(
      body: params[:message][:body],
      user_id: params[:message][:user_id]
    )
---
UPDATE "messages" SET "body" = ?, "user_id" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["body", "My new message"], ["user_id", 5], ["updated_at", "2022-07-04 20:12:42.350680"], ["id", 1]]

  def destroy
    #@message = Message.find(params[:id])
    @message.destroy
---
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 9]]

  def index
    # множественное число! html each
    @messages = Message.all
---
SELECT "messages".* FROM "messages"